urixie/ESP32S3_Para_Update_Tools/esp32s3/components/app_web_file_server/app_web_file_server.c
    if (req->content_len <= 0) {
        return send_json_error(req, "400 Bad Request", "上传内容为空");
    }

    char filename_encoded[APP_WEB_MAX_PATH];
    char filename[APP_WEB_MAX_PATH];
    if (get_query_value(req, "filename", filename_encoded, sizeof(filename_encoded)) != ESP_OK ||
        url_decode(filename, sizeof(filename), filename_encoded) != ESP_OK ||
        !valid_upload_name(filename)) {
        return send_json_error(req, "400 Bad Request", "文件名无效");
    }

    char full_path[APP_WEB_MAX_PATH];
    int len = snprintf(full_path, sizeof(full_path), "%s/%s", s_mount_point, filename);
    if (len <= 0 || (size_t)len >= sizeof(full_path)) {
        return send_json_error(req, "400 Bad Request", "文件名过长");
    }

    char tmp_path[APP_WEB_MAX_PATH];
    len = snprintf(tmp_path, sizeof(tmp_path), "%s.tmp", full_path);
    if (len <= 0 || (size_t)len >= sizeof(tmp_path)) {
        return send_json_error(req, "400 Bad Request", "文件名过长");
    }

    log_heap_state("文件上传开始");
    ESP_LOGI(TAG, "upload start: %s, tmp=%s, size=%zu", full_path, tmp_path, req->content_len);
    if (app_storage_lock(portMAX_DELAY) != ESP_OK) {
        return send_json_error(req, "503 Service Unavailable", "文件系统忙");
    }

    FILE *f = fopen(tmp_path, "wb");
    if (f == NULL) {
        int err = errno;
        app_storage_unlock();
        ESP_LOGE(TAG, "open tmp upload file failed: %s, errno=%d", tmp_path, err);
        return send_json_error(req, "500 Internal Server Error", "创建文件失败");
    }

    char *buf = malloc(APP_WEB_UPLOAD_BUF_SIZE);
    if (buf == NULL) {
        fclose(f);
        remove(tmp_path);
        app_storage_unlock();
        return send_json_error(req, "500 Internal Server Error", "内存不足");
    }

    const size_t total = req->content_len;
    size_t remaining = total;
    size_t received = 0;
    size_t last_log = 0;
    int timeout_count = 0;
    const int max_timeout_count = 30;
    esp_err_t ret = ESP_OK;

    while (remaining > 0) {
        size_t want = remaining > APP_WEB_UPLOAD_BUF_SIZE ? APP_WEB_UPLOAD_BUF_SIZE : remaining;
        int recv_len = httpd_req_recv(req, buf, want);
        if (recv_len <= 0) {
            if (recv_len == HTTPD_SOCK_ERR_TIMEOUT && timeout_count++ < max_timeout_count) {
                ESP_LOGW(TAG, "upload recv timeout %d/%d, received=%zu/%zu",
                         timeout_count, max_timeout_count, received, total);
                continue;
            }
            ESP_LOGE(TAG, "upload recv failed: recv_len=%d, received=%zu/%zu", recv_len, received, total);
            ret = recv_len == HTTPD_SOCK_ERR_TIMEOUT ? ESP_ERR_TIMEOUT : ESP_FAIL;
            break;
        }

        timeout_count = 0;
        if (fwrite(buf, 1, recv_len, f) != (size_t)recv_len) {
            int err = errno;
            ESP_LOGE(TAG, "upload write failed, received=%zu/%zu, errno=%d", received, total, err);
            ret = ESP_FAIL;
            break;
        }

        remaining -= recv_len;
        received += recv_len;
        if (received == total || received - last_log >= 64 * 1024) {
            ESP_LOGI(TAG, "upload progress: %zu/%zu", received, total);
            last_log = received;
        }
    }

    free(buf);

    if (ret == ESP_OK && received != total) {
        ESP_LOGE(TAG, "upload size mismatch: received=%zu/%zu", received, total);
        ret = ESP_FAIL;
    }

    if (ret == ESP_OK && fflush(f) != 0) {
        int err = errno;
        ESP_LOGE(TAG, "upload fflush failed errno=%d", err);
        ret = ESP_FAIL;
    }

    if (fclose(f) != 0 && ret == ESP_OK) {
        int err = errno;
        ESP_LOGE(TAG, "upload fclose failed errno=%d", err);
        ret = ESP_FAIL;
    }
    f = NULL;

    if (ret == ESP_OK) {
        remove(full_path);
        if (rename(tmp_path, full_path) != 0) {
            int err = errno;
            ESP_LOGE(TAG, "upload rename failed: %s -> %s, errno=%d", tmp_path, full_path, err);
            ret = ESP_FAIL;
        }
    }

    if (ret != ESP_OK) {
        remove(tmp_path);
    }

    app_storage_unlock();

    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "upload failed: %s, received=%zu/%zu, err=%s",
                 full_path, received, total, esp_err_to_name(ret));
        return send_json_error(req, "500 Internal Server Error", "上传失败");
    }

    log_heap_state("文件上传完成");
    ESP_LOGI(TAG, "upload done: %s, received=%zu", full_path, received);
    httpd_resp_set_type(req, "application/json; charset=utf-8");
    set_connection_close(req);
    return httpd_resp_sendstr(req, "{\"ok\":true}");
}

static esp_err_t delete_handler(httpd_req_t *req)
{
    if (!web_auth_is_logged_in(req)) {
        return send_json_error(req, "401 Unauthorized", "请先登录");
    }

    char body[APP_WEB_MAX_PATH];
    if (read_form_body(req, body, sizeof(body)) != ESP_OK) {
        return send_json_error(req, "400 Bad Request", "缺少请求内容");
    }

    char encoded_path[APP_WEB_MAX_PATH] = {0};
    if (httpd_query_key_value(body, "path", encoded_path, sizeof(encoded_path)) != ESP_OK) {
        return send_json_error(req, "400 Bad Request", "缺少文件路径");
    }

    char full_path[APP_WEB_MAX_PATH];
    if (build_storage_path(encoded_path, false, full_path, sizeof(full_path)) != ESP_OK) {
        return send_json_error(req, "400 Bad Request", "路径无效");
    }

    ESP_LOGI(TAG, "delete start: %s", full_path);
    if (app_storage_lock(portMAX_DELAY) != ESP_OK) {
        return send_json_error(req, "503 Service Unavailable", "文件系统忙");
    }

    struct stat st;
    if (stat(full_path, &st) != 0) {
        app_storage_unlock();
        return send_json_error(req, "404 Not Found", "文件不存在");
    }
    if (S_ISDIR(st.st_mode)) {
        app_storage_unlock();
        return send_json_error(req, "400 Bad Request", "暂不支持删除目录");
    }
    if (remove(full_path) != 0) {
        int err = errno;
        app_storage_unlock();
        ESP_LOGE(TAG, "delete failed errno=%d", err);
        return send_json_error(req, "500 Internal Server Error", "删除失败");
    }

    app_storage_unlock();
    ESP_LOGI(TAG, "delete done: %s", full_path);
    httpd_resp_set_type(req, "application/json; charset=utf-8");
    set_connection_close(req);
    return httpd_resp_sendstr(req, "{\"ok\":true}");
}

static void send_visible_param_json(httpd_req_t *req, const app_param_bin_parameter_t *p, bool first)
{
    char buf[192];
    snprintf(buf, sizeof(buf), "%s{\"name\":\"", first ? "" : ",");
    httpd_resp_sendstr_chunk(req, buf);
    json_escape_send(req, p->name);
    snprintf(buf, sizeof(buf),
             "\",\"address\":%u,\"defaultValue\":%lu,\"paramType\":\"%s\",\"paramTypeLabel\":\"%s\"}",
             p->address,
             (unsigned long)p->default_value,
             app_param_bin_type_name(p->param_type),
             app_param_bin_type_label(p->param_type));
    httpd_resp_sendstr_chunk(req, buf);
}

static esp_err_t param_ns_to_board_tick(uint32_t value_ns,
                                        uint16_t *out_tick,
                                        char *err_msg,
                                        size_t err_msg_size)
{
    if (value_ns > APP_WEB_PARAM_MAX_NS_VALUE) {
        snprintf(err_msg, err_msg_size, "参数值必须在 0~%lu ns",
                 (unsigned long)APP_WEB_PARAM_MAX_NS_VALUE);
        return ESP_ERR_INVALID_ARG;
    }
    if ((value_ns % APP_WEB_PARAM_TIME_BASE_NS) != 0) {
        snprintf(err_msg, err_msg_size, "参数值必须是 %u ns 的整数倍",
                 (unsigned int)APP_WEB_PARAM_TIME_BASE_NS);
        return ESP_ERR_INVALID_ARG;
    }

    uint32_t tick = value_ns / APP_WEB_PARAM_TIME_BASE_NS;
    if (tick > UINT16_MAX) {
        snprintf(err_msg, err_msg_size, "参数值超过板卡存储范围");
        return ESP_ERR_INVALID_ARG;
    }

