urixie/ESP32S3_Para_Update_Tools/esp32s3/components/app_web_file_server/app_web_file_server.c
    *out_tick = (uint16_t)tick;
    return ESP_OK;
}

static esp_err_t param_ns_values_to_board_ticks(const uint32_t values_ns[APP_PARAM_BIN_PARAM_COUNT],
                                                uint16_t board_values[APP_PARAM_BIN_PARAM_COUNT],
                                                char *err_msg,
                                                size_t err_msg_size)
{
    for (size_t i = 0; i < APP_PARAM_BIN_PARAM_COUNT; i++) {
        esp_err_t ret = param_ns_to_board_tick(values_ns[i], &board_values[i], err_msg, err_msg_size);
        if (ret != ESP_OK) {
            char detail[160];
            snprintf(detail, sizeof(detail), "参数地址 %u：%s", (unsigned int)i,
                     err_msg != NULL && err_msg[0] != '\0' ? err_msg : "参数值无效");
            snprintf(err_msg, err_msg_size, "%s", detail);
            return ret;
        }
    }
    return ESP_OK;
}

static uint32_t param_board_tick_to_ns(uint16_t value)
{
    return (uint32_t)value * APP_WEB_PARAM_TIME_BASE_NS;
}

static void build_param_defaults_ns(const app_param_bin_result_t *parsed, uint32_t defaults_ns[APP_PARAM_BIN_PARAM_COUNT])
{
    memset(defaults_ns, 0, sizeof(uint32_t) * APP_PARAM_BIN_PARAM_COUNT);
    for (size_t i = 0; i < APP_PARAM_BIN_PARAM_COUNT; i++) {
        const app_param_bin_parameter_t *p = &parsed->parameters[i];
        if (p->address < APP_PARAM_BIN_PARAM_COUNT) {
            defaults_ns[p->address] = p->default_value;
        }
    }
}

static bool param_address_is_visible(const app_param_bin_result_t *parsed, uint8_t address)
{
    for (size_t i = 0; i < APP_PARAM_BIN_PARAM_COUNT; i++) {
        const app_param_bin_parameter_t *p = &parsed->parameters[i];
        if (p->address == address) {
            return p->permission == APP_PARAM_BIN_PERMISSION_VISIBLE;
        }
    }
    return false;
}

static esp_err_t parse_param_values(const char *text,
                                    const app_param_bin_result_t *parsed,
                                    bool provided[APP_PARAM_BIN_PARAM_COUNT],
                                    uint32_t values_ns[APP_PARAM_BIN_PARAM_COUNT],
                                    char *err_msg,
                                    size_t err_msg_size)
{
    if (text == NULL || text[0] == '\0') {
        snprintf(err_msg, err_msg_size, "缺少参数值");
        return ESP_ERR_INVALID_ARG;
    }

    char buf[1024];
    int len = snprintf(buf, sizeof(buf), "%s", text);
    if (len <= 0 || (size_t)len >= sizeof(buf)) {
        snprintf(err_msg, err_msg_size, "参数值过长");
        return ESP_ERR_INVALID_SIZE;
    }

    char *saveptr = NULL;
    char *token = strtok_r(buf, ",", &saveptr);
    while (token != NULL) {
        char *sep = strchr(token, ':');
        if (sep == NULL) {
            snprintf(err_msg, err_msg_size, "参数格式错误");
            return ESP_ERR_INVALID_ARG;
        }
        *sep = '\0';
        char *end = NULL;
        unsigned long addr = strtoul(token, &end, 10);
        if (end == token || *end != '\0' || addr >= APP_PARAM_BIN_PARAM_COUNT) {
            snprintf(err_msg, err_msg_size, "参数地址无效");
            return ESP_ERR_INVALID_ARG;
        }
        unsigned long value = strtoul(sep + 1, &end, 10);
        if (end == sep + 1 || *end != '\0' || value > APP_WEB_PARAM_MAX_NS_VALUE) {
            snprintf(err_msg, err_msg_size, "参数值无效");
            return ESP_ERR_INVALID_ARG;
        }
        uint16_t unused_tick = 0;
        esp_err_t ret = param_ns_to_board_tick((uint32_t)value, &unused_tick, err_msg, err_msg_size);
        if (ret != ESP_OK) {
            return ret;
        }
        if (!param_address_is_visible(parsed, (uint8_t)addr)) {
            snprintf(err_msg, err_msg_size, "参数地址未授权");
            return ESP_ERR_INVALID_ARG;
        }
        provided[addr] = true;
        values_ns[addr] = (uint32_t)value;
        token = strtok_r(NULL, ",", &saveptr);
    }

    for (size_t i = 0; i < APP_PARAM_BIN_PARAM_COUNT; i++) {
        const app_param_bin_parameter_t *p = &parsed->parameters[i];
        if (p->permission == APP_PARAM_BIN_PERMISSION_VISIBLE && !provided[p->address]) {
            snprintf(err_msg, err_msg_size, "存在未填写的可见参数");
            return ESP_ERR_INVALID_ARG;
        }
    }
    return ESP_OK;
}

static esp_err_t bin_parse_handler(httpd_req_t *req)
{
    if (!web_auth_is_logged_in(req)) {
        return send_json_error(req, "401 Unauthorized", "请先登录");
    }

    char raw_path[APP_WEB_MAX_PATH];
    char full_path[APP_WEB_MAX_PATH];
    if (get_query_value(req, "path", raw_path, sizeof(raw_path)) != ESP_OK ||
        build_storage_path(raw_path, false, full_path, sizeof(full_path)) != ESP_OK) {
        return send_json_error(req, "400 Bad Request", "路径无效");
    }

    if (!ends_with_ignore_case(full_path, ".bin")) {
        return send_json_error(req, "400 Bad Request", "只支持解析 .bin 文件");
    }

    app_param_bin_result_t *parsed = calloc(1, sizeof(*parsed));
    if (parsed == NULL) {
        return send_json_error(req, "500 Internal Server Error", "内存不足");
    }

    char parse_error[160];
    parse_error[0] = '\0';

    if (app_storage_lock(portMAX_DELAY) != ESP_OK) {
        free(parsed);
        return send_json_error(req, "503 Service Unavailable", "文件系统忙");
    }
    esp_err_t ret = app_param_bin_parse_file(full_path, parsed, parse_error, sizeof(parse_error));
    app_storage_unlock();

    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "parse failed %s: %s", full_path, parse_error);
        free(parsed);
        return send_json_error(req, "422 Unprocessable Entity", parse_error[0] != '\0' ? parse_error : "解析失败");
    }

    httpd_resp_set_type(req, "application/json; charset=utf-8");
    set_connection_close(req);
    httpd_resp_sendstr_chunk(req, "{\"ok\":true,\"boardName\":\"");
    json_escape_send(req, parsed->board_name);
    httpd_resp_sendstr_chunk(req, "\",\"parameters\":[");

    bool first = true;
    size_t visible_count = 0;
    for (size_t i = 0; i < APP_PARAM_BIN_PARAM_COUNT; i++) {
        const app_param_bin_parameter_t *param = &parsed->parameters[i];
        if (param->permission != APP_PARAM_BIN_PERMISSION_VISIBLE) {
            continue;
        }
        send_visible_param_json(req, param, first);
        first = false;
        visible_count++;
    }

    char tail[64];
    snprintf(tail, sizeof(tail), "],\"visibleCount\":%u}", (unsigned int)visible_count);
    httpd_resp_sendstr_chunk(req, tail);
    free(parsed);
    return httpd_resp_send_chunk(req, NULL, 0);
}

static esp_err_t load_parsed_bin(const char *encoded_path,
                                 app_param_bin_result_t **out,
                                 char *err_msg,
                                 size_t err_msg_size)
{
    char full_path[APP_WEB_MAX_PATH];
    if (build_storage_path(encoded_path, false, full_path, sizeof(full_path)) != ESP_OK) {
        snprintf(err_msg, err_msg_size, "路径无效");
        return ESP_ERR_INVALID_ARG;
    }
    if (!ends_with_ignore_case(full_path, ".bin")) {
        snprintf(err_msg, err_msg_size, "只支持 .bin 板卡配置");
        return ESP_ERR_INVALID_ARG;
    }

